In [1]:
import numpy as np
import pandas as pd
import seaborn as sns

In [155]:
titanic = sns.load_dataset("titanic")
titanic

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
4,0,3,male,35.0,0,0,8.0500,S,Third,man,True,NaN,Southampton,no,True
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,0,2,male,27.0,0,0,13.0000,S,Second,man,True,NaN,Southampton,no,True
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.0000,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.7500,Q,Third,man,True,NaN,Queenstown,no,True

In [3]:
titanic.head(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
0,0,3,male,22.0,1,0,7.2500,S,Third,man,True,NaN,Southampton,no,False
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True

In [4]:
titanic.tail(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
888,0,3,female,NaN,1,2,23.45,S,Third,woman,False,NaN,Southampton,no,False
889,1,1,male,26.0,0,0,30.00,C,First,man,True,C,Cherbourg,yes,True
890,0,3,male,32.0,0,0,7.75,Q,Third,man,True,NaN,Queenstown,no,True

## 랜덤으로 정해진 갯수만큼의 값을 가져온다

In [5]:
titanic.sample(3)

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
36,1,3,male,NaN,0,0,7.2292,C,Third,man,True,NaN,Cherbourg,yes,True
607,1,1,male,27.0,0,0,30.5000,S,First,man,True,NaN,Southampton,yes,True
690,1,1,male,31.0,1,0,57.0000,S,First,man,True,B,Southampton,yes,False

In [6]:
titanic.sample()

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
107,1,3,male,NaN,0,0,7.775,S,Third,man,True,NaN,Southampton,yes,True

# DataFrame

## 수학연산 nunique()메서드

In [7]:
# 각 컬럼마다 갖는 고유 값을 series객체로 반환
titanic.nunique()

survived         2
pclass           3
sex              2
age             88
sibsp            7
parch            7
fare           248
embarked         3
class            3
who              3
adult_male       2
deck             7
embark_town      3
alive            2
alone            2
dtype: int64

## count() 컬럼마다의 데이터의 개수

In [8]:
# nan값을 데이터의 갯수로 포함 시키지 않는다./ len()은 nan값을 포함
titanic.count()

survived       891
pclass         891
sex            891
age            714
sibsp          891
parch          891
fare           891
embarked       889
class          891
who            891
adult_male     891
deck           203
embark_town    889
alive          891
alone          891
dtype: int64

In [9]:
len(titanic)

891

## 타입 조회

In [10]:
titanic.dtypes

survived          int64
pclass            int64
sex              object
age             float64
sibsp             int64
parch             int64
fare            float64
embarked         object
class          category
who              object
adult_male         bool
deck           category
embark_town      object
alive            object
alone              bool
dtype: object

In [11]:
# skipna 기본적으로 True값을 가지고 있다.
titanic.sum(numeric_only = True)

survived        342.0000
pclass         2057.0000
age           21205.1700
sibsp           466.0000
parch           340.0000
fare          28693.9493
adult_male      537.0000
alone           537.0000
dtype: float64

In [12]:
#인수 axis를 갖는다. axis = "columns" / 1  = 각 로우별 값
titanic[["age","fare","survived"]].sum(axis="columns")

0       29.2500
1      110.2833
2       34.9250
3       89.1000
4       43.0500
         ...
886     40.0000
887     50.0000
888     23.4500
889     57.0000
890     39.7500
Length: 891, dtype: float64

In [13]:
#인수 axis를 갖는다. axis = "rows" / 0
titanic[["age","fare","survived"]].sum(axis="rows")

age         21205.1700
fare        28693.9493
survived      342.0000
dtype: float64

In [14]:
# nsmaillest(), nlargeset() 메서드
titanic.nlargest(3, columns=["fare","age"])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True

In [15]:
# nsmaillest(), nlargeset() 메서드
titanic.nsmallest(3, columns=["age"])

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
803,1,3,male,0.42,0,1,8.5167,C,Third,child,False,NaN,Cherbourg,yes,False
755,1,2,male,0.67,1,1,14.5000,S,Second,child,False,NaN,Southampton,yes,False
469,1,3,female,0.75,2,1,19.2583,C,Third,child,False,NaN,Cherbourg,yes,False

In [16]:
titanic.describe()

         survived      pclass         age       sibsp       parch        fare
count  891.000000  891.000000  714.000000  891.000000  891.000000  891.000000
mean     0.383838    2.308642   29.699118    0.523008    0.381594   32.204208
std      0.486592    0.836071   14.526497    1.102743    0.806057   49.693429
min      0.000000    1.000000    0.420000    0.000000    0.000000    0.000000
25%      0.000000    2.000000   20.125000    0.000000    0.000000    7.910400
50%      0.000000    3.000000   28.000000    0.000000    0.000000   14.454200
75%      1.000000    3.000000   38.000000    1.000000    0.000000   31.000000
max      1.000000    3.000000   80.000000    8.000000    6.000000  512.329200

In [17]:
%%writefile datas/nba.csv
Name,Team,Position,Birthday,Salary
Shake Milton,Philadelphia 76ers,SG,9/26/96,1445697
Christian Wood,Detroit Pistons,PF,9/27/95,1645357
PJ Washington,Charlotte Hornets,PF,8/23/98,3831840
Derrick Rose,Detroit Pistons,PG,10/4/88,7317074
Marial Shayok,Philadelphia 76ers,G,7/26/95,79568
Draymond Green,Golden State Warriors,PF,3/4/90,18539130
Kendrick Nunn,Miami Heat,SG,8/3/95,1416852
Cedi Osman,Cleveland Cavaliers,SF,4/8/95,2907143
Brook Lopez,Milwaukee Bucks,C,4/1/88,12093024
Torrey Craig,Denver Nuggets,SF,12/19/90,2000000
Jordan Clarkson,Cleveland Cavaliers,PG,6/7/92,13437500
Alex Caruso,Los Angeles Lakers,PG,2/28/94,2750000
Norvel Pelle,Philadelphia 76ers,FC,2/3/93,79568
Tyler Johnson,Phoenix Suns,PG,5/7/92,19245370
Alec Burks,Golden State Warriors,SG,7/20/91,2320044
JaMychal Green,Los Angeles Clippers,PF,6/21/90,4767000
Dwight Howard,Los Angeles Lakers,C,12/8/85,5603850
Nikola Jokic,Denver Nuggets,C,2/19/95,27504630
Chris Boucher,Toronto Raptors,PF,1/11/93,1588231
Marcus Morris,New York Knicks,PF,9/2/89,15000000
Kevin Huerter,Atlanta Hawks,SG,8/27/98,2636280
Rui Hachimura,Washington Wizards,PF,2/8/98,4469160
George Hill,Milwaukee Bucks,PG,5/4/86,10133907
Nickeil Alexander-Walker,New Orleans Pelicans,SG,9/2/98,2964840
Jaylen Hoard,Portland Trail Blazers,SF,3/30/99,79568
Tyler Cook,Cleveland Cavaliers,PF,9/23/97,79568
Otto Porter,Chicago Bulls,SF,6/3/93,27250576
Langston Galloway,Detroit Pistons,PG,12/9/91,7333333
Evan Turner,Atlanta Hawks,PG,10/27/88,18606556
Norman Powell,Toronto Raptors,SG,5/25/93,10116576
Nicolas Claxton,Brooklyn Nets,PF,4/17/99,898310
Michael Frazier,Houston Rockets,G,3/8/94,79568
Paul Millsap,Denver Nuggets,PF,2/10/85,30000000
Furkan Korkmaz,Philadelphia 76ers,SG,7/24/97,1620564
Trey Burke,Philadelphia 76ers,PG,11/12/92,2028594
Bradley Beal,Washington Wizards,SG,6/28/93,27093018
Thomas Bryant,Washington Wizards,C,7/31/97,8000000
Dean Wade,Cleveland Cavaliers,PF,11/20/96,79568
Chris Paul,Oklahoma City Thunder,PG,5/6/85,38506482
Josh Hart,New Orleans Pelicans,SF,3/6/95,1934160
LaMarcus Aldridge,San Antonio Spurs,C,7/19/85,26000000
DaQuan Jeffries,Sacramento Kings,SG,8/30/97,898310
Hamidou Diallo,Oklahoma City Thunder,SF,7/31/98,1416852
Jamal Murray,Denver Nuggets,PG,2/23/97,4444746
Darius Bazley,Oklahoma City Thunder,PF,6/12/00,2284800
Robert Franks,Charlotte Hornets,F,12/18/96,79568
Gerald Green,Houston Rockets,SF,1/26/86,2564753
Thaddeus Young,Chicago Bulls,PF,6/21/88,12900000
Sviatoslav Mykhailiuk,Detroit Pistons,SF,6/10/97,1416852
Ian Mahinmi,Washington Wizards,C,11/5/86,15450051
Deonte Burton,Oklahoma City Thunder,SG,1/31/94,1416852
Markelle Fultz,Orlando Magic,PG,5/29/98,9745200
Aaron Gordon,Orlando Magic,PF,9/16/95,19863636
Dzanan Musa,Brooklyn Nets,SF,5/8/99,1911600
Patrick McCaw,Toronto Raptors,SF,10/25/95,4000000
Bismack Biyombo,Charlotte Hornets,C,8/28/92,17000000
JaVale McGee,Los Angeles Lakers,C,1/19/88,4000000
Juwan Morgan,Utah Jazz,F,4/17/97,796806
Marc Gasol,Toronto Raptors,C,1/29/85,25595700
Marcus Smart,Boston Celtics,PG,3/6/94,12553571
Rudy Gobert,Utah Jazz,C,6/26/92,24258427
Wesley Iwundu,Orlando Magic,SF,12/20/94,1618520
Dwight Powell,Dallas Mavericks,C,7/20/91,10259375
Goran Dragic,Miami Heat,PG,5/6/86,19217900
Theo Pinson,Brooklyn Nets,SG,11/5/95,1445697
Danilo Gallinari,Oklahoma City Thunder,PF,8/8/88,22615559
Joe Ingles,Utah Jazz,PF,10/2/87,11454546
Jarrett Culver,Minnesota Timberwolves,SG,2/20/99,5813640
Robert Covington,Minnesota Timberwolves,PF,12/14/90,11301219
Damyean Dotson,New York Knicks,SG,5/6/94,1618520
Patrick Beverley,Los Angeles Clippers,PG,7/12/88,12345680
Kevin Love,Cleveland Cavaliers,C,9/7/88,28942830
Quinn Cook,Los Angeles Lakers,PG,3/23/93,3000000
Justin Wright-Foreman,Utah Jazz,G,10/27/97,79568
Noah Vonleh,Minnesota Timberwolves,C,8/24/95,2000000
Tyus Jones,Memphis Grizzlies,PG,5/10/96,9258000
Dewayne Dedmon,Sacramento Kings,C,8/12/89,13333334
Malcolm Brogdon,Indiana Pacers,PG,12/11/92,20000000
Ben McLemore,Houston Rockets,SG,2/11/93,2028594
Wilson Chandler,Brooklyn Nets,PF,5/10/87,2564753
Isaac Bonga,Washington Wizards,PG,11/8/99,1416852
Adam Mokoka,Chicago Bulls,G,7/18/98,79568
Lonzo Ball,New Orleans Pelicans,PG,10/27/97,8719320
Jalen Brunson,Dallas Mavericks,PG,8/31/96,1416852
John Collins,Atlanta Hawks,PF,9/23/97,2686560
Marvin Williams,Charlotte Hornets,PF,6/19/86,15006250
Brad Wanamaker,Boston Celtics,PG,7/25/89,1445697
Donte DiVincenzo,Milwaukee Bucks,SG,1/31/97,2905800
Omari Spellman,Golden State Warriors,PF,7/21/97,1897800
Joe Harris,Brooklyn Nets,SF,9/6/91,7666667
Royce O'Neale,Utah Jazz,PF,6/5/93,1618520
Deandre Ayton,Phoenix Suns,C,7/23/98,9562920
Cory Joseph,Sacramento Kings,PG,8/20/91,12000000
Malcolm Miller,Toronto Raptors,SF,3/6/93,1588231
Justise Winslow,Miami Heat,PF,3/26/96,13000000
Kevin Durant,Brooklyn Nets,PF,9/29/88,37199000
Evan Fournier,Orlando Magic,SF,10/29/92,17000000
Chris Silva,Miami Heat,PF,9/19/96,79568
Vince Carter,Atlanta Hawks,PF,1/26/77,2564753
Cody Zeller,Charlotte Hornets,C,10/5/92,14471910
Brian Bowen,Indiana Pacers,SG,10/2/98,79568
Aaron Holiday,Indiana Pacers,PG,9/30/96,2239200
Troy Daniels,Los Angeles Lakers,SG,7/15/91,2028594
Buddy Hield,Sacramento Kings,SG,12/17/92,4861207
Terance Mann,Los Angeles Clippers,SG,10/18/96,1000000
John Konchar,Memphis Grizzlies,SG,3/22/96,79568
KZ Okpala,Miami Heat,SF,4/28/99,898310
Denzel Valentine,Chicago Bulls,SF,11/16/93,3377568
Marquese Chriss,Golden State Warriors,PF,7/2/97,1678854
Anthony Davis,Los Angeles Lakers,C,3/11/93,27093019
Nemanja Bjelica,Sacramento Kings,PF,5/9/88,6825000
Chandler Parsons,Atlanta Hawks,SF,10/25/88,25102512
Courtney Lee,Dallas Mavericks,SG,10/3/85,12759670
Myles Turner,Indiana Pacers,C,3/24/96,18000000
Kyle O'Quinn,Philadelphia 76ers,C,3/26/90,2174318
Bryn Forbes,San Antonio Spurs,SG,7/23/93,2875000
Duncan Robinson,Miami Heat,PF,4/22/94,1416852
Devin Booker,Phoenix Suns,SG,10/30/96,27285000
Grant Williams,Boston Celtics,PF,11/30/98,2379840
DeMarcus Cousins,Los Angeles Lakers,C,8/13/90,3500000
DeMar DeRozan,San Antonio Spurs,SF,8/7/89,27739975
Kristaps Porzingis,Dallas Mavericks,PF,8/2/95,27285000
Brandon Knight,Cleveland Cavaliers,PG,12/2/91,15643750
Thabo Sefolosha,Houston Rockets,PF,5/2/84,2564753
David Nwaba,Brooklyn Nets,SF,1/14/93,1678854
Quinndary Weatherspoon,San Antonio Spurs,G,9/10/96,79568
Dewan Hernandez,Toronto Raptors,C,12/9/96,898310
Isaiah Thomas,Washington Wizards,PG,2/7/89,2320044
Bruce Brown,Detroit Pistons,SG,8/15/96,1416852
Keldon Johnson,San Antonio Spurs,SF,10/11/99,1950600
Damian Jones,Atlanta Hawks,C,6/30/95,2305057
Luguentz Dort,Oklahoma City Thunder,G,4/19/99,79568
Terence Davis,Toronto Raptors,SG,5/16/97,898310
Chandler Hutchison,Chicago Bulls,SF,4/26/96,2332320
Steven Adams,Oklahoma City Thunder,C,7/20/93,25842697
Jordan Poole,Golden State Warriors,SG,6/19/99,1964760
Sekou Doumbouya,Detroit Pistons,SF,12/23/00,3285120
Zion Williamson,New Orleans Pelicans,F,7/6/00,9757440
Mike Muscala,Oklahoma City Thunder,C,7/1/91,2028594
Skal Labissiere,Portland Trail Blazers,C,3/18/96,2338846
Meyers Leonard,Miami Heat,C,2/27/92,11286515
Reggie Jackson,Detroit Pistons,PG,4/16/90,18086956
Alfonzo McKinnie,Cleveland Cavaliers,SF,9/17/92,1588231
Yuta Watanabe,Memphis Grizzlies,SF,10/13/94,79568
Kentavious Caldwell-Pope,Los Angeles Lakers,SG,2/18/93,8089282
Kelan Martin,Minnesota Timberwolves,SF,8/3/95,79568
OG Anunoby,Toronto Raptors,SF,7/17/97,2281800
Tyler Herro,Miami Heat,SG,1/20/00,3640200
Richaun Holmes,Sacramento Kings,C,10/15/93,4767000
Tyson Chandler,Houston Rockets,C,10/2/82,2564753
Solomon Hill,Memphis Grizzlies,SF,3/18/91,13290395
Keita Bates-Diop,Minnesota Timberwolves,SF,1/23/96,1416852
Kelly Olynyk,Miami Heat,C,4/19/91,12667885
Jaxson Hayes,New Orleans Pelicans,C,5/23/00,4862040
CJ McCollum,Portland Trail Blazers,SG,9/19/91,27556959
Darius Miller,New Orleans Pelicans,SF,3/21/90,7250000
Luka Doncic,Dallas Mavericks,PG,2/28/99,7683360
DeMarre Carroll,San Antonio Spurs,PF,7/27/86,7000000
Cristiano Felicio,Chicago Bulls,C,7/7/92,8156500
Zach LaVine,Chicago Bulls,PG,3/10/95,19500000
Tremont Waters,Boston Celtics,PG,1/10/98,79568
Dejounte Murray,San Antonio Spurs,PG,9/19/96,2321735
Jerome Robinson,Los Angeles Clippers,SG,2/22/97,3567720
Rudy Gay,San Antonio Spurs,PF,8/17/86,14500000
Ryan Broekhoff,Dallas Mavericks,SG,8/23/90,1416852
Jake Layman,Minnesota Timberwolves,PF,3/7/94,3581986
Cameron Johnson,Phoenix Suns,PF,3/3/96,4033440
Allen Crabbe,Atlanta Hawks,SG,4/9/92,18500000
Justin James,Sacramento Kings,SG,1/24/97,898310
Emmanuel Mudiay,Utah Jazz,PG,3/5/96,1737145
Avery Bradley,Los Angeles Lakers,PG,11/26/90,6767000
Victor Oladipo,Indiana Pacers,PG,5/4/92,21000000
Caleb Martin,Charlotte Hornets,SF,9/28/95,898310
Coby White,Chicago Bulls,SG,2/16/00,5307120
Isaiah Hartenstein,Houston Rockets,C,5/5/98,1416852
Will Barton,Denver Nuggets,SF,1/6/91,12776786
Dwayne Bacon,Charlotte Hornets,SG,8/30/95,1618520
Harrison Barnes,Sacramento Kings,PF,5/30/92,24147727
Tim Frazier,Detroit Pistons,PG,11/1/90,1620564
Jimmy Butler,Miami Heat,SF,9/14/89,32742000
Gary Harris,Denver Nuggets,SG,9/14/94,17839286
Thon Maker,Detroit Pistons,C,2/25/97,3569643
Shai Gilgeous-Alexander,Oklahoma City Thunder,PG,7/12/98,3952920
Hassan Whiteside,Portland Trail Blazers,C,6/13/89,27093018
Karl-Anthony Towns,Minnesota Timberwolves,C,11/15/95,27285000
Ky Bowman,Golden State Warriors,PG,6/16/97,79568
Ben Simmons,Philadelphia 76ers,PG,7/20/96,8113929
Terrence Ross,Orlando Magic,SF,2/5/91,12500000
Jordan McLaughlin,Minnesota Timberwolves,PG,4/9/96,79568
Daniel Theis,Boston Celtics,C,4/4/92,5000000
Jonathan Isaac,Orlando Magic,PF,10/3/97,5806440
Cheick Diallo,Phoenix Suns,C,9/13/96,1678854
Serge Ibaka,Toronto Raptors,C,9/18/89,23271604
Amile Jefferson,Orlando Magic,PF,5/7/93,1339515
Cam Reddish,Atlanta Hawks,SF,9/1/99,4245720
De'Anthony Melton,Memphis Grizzlies,PG,5/28/98,1416852
Udonis Haslem,Miami Heat,C,6/9/80,2564753
Charlie Brown,Atlanta Hawks,SG,2/2/97,79568
Elie Okobo,Phoenix Suns,PG,10/23/97,1416852
Gordon Hayward,Boston Celtics,PF,3/23/90,32700690
Marco Belinelli,San Antonio Spurs,SF,3/25/86,5846154
Javonte Green,Boston Celtics,SF,7/23/93,898310
Rondae Hollis-Jefferson,Toronto Raptors,SF,1/3/95,2500000
Carmelo Anthony,Portland Trail Blazers,PF,5/29/84,2159029
Danny Green,Los Angeles Lakers,SG,6/22/87,14634147
Stephen Curry,Golden State Warriors,PG,3/14/88,40231758
Eric Paschall,Golden State Warriors,PF,11/4/96,898310
Daniel Gafford,Chicago Bulls,C,10/1/98,898310
Anfernee Simons,Portland Trail Blazers,SG,6/8/99,2149560
Frank Kaminsky,Phoenix Suns,C,4/4/93,4767000
Luke Kennard,Detroit Pistons,SG,6/24/96,3827160
Josh Okogie,Minnesota Timberwolves,SG,9/1/98,2530680
Rodney Hood,Portland Trail Blazers,SF,10/20/92,5718000
De'Andre Hunter,Atlanta Hawks,SF,12/2/97,7068360
Klay Thompson,Golden State Warriors,SG,2/8/90,32742000
Jrue Holiday,New Orleans Pelicans,PG,6/12/90,26131111
PJ Dozier,Denver Nuggets,PG,10/25/96,79568
Andre Drummond,Detroit Pistons,C,8/10/93,27093018
Jared Harper,Phoenix Suns,PG,9/14/97,79568
Russell Westbrook,Houston Rockets,PG,11/12/88,38506482
Tony Bradley,Utah Jazz,C,1/8/98,1962360
Oshae Brissett,Toronto Raptors,SF,6/20/98,79568
Gary Clark,Houston Rockets,PF,11/16/94,1416852
Pascal Siakam,Toronto Raptors,PF,4/2/94,2351838
Eric Bledsoe,Milwaukee Bucks,PG,12/9/89,15625000
Tomas Satoransky,Chicago Bulls,PG,10/30/91,10000000
Davis Bertans,Washington Wizards,PF,11/12/92,7000000
Amir Coffey,Los Angeles Clippers,G,6/17/97,79568
Ignas Brazdeikis,New York Knicks,SF,1/8/99,898310
Ivan Rabb,New York Knicks,PF,2/4/97,79568
Khris Middleton,Milwaukee Bucks,SF,8/12/91,30603448
Kevin Knox,New York Knicks,PF,8/11/99,4380120
Jeff Green,Utah Jazz,PF,8/28/86,2564753
Ersan Ilyasova,Milwaukee Bucks,PF,5/15/87,7000000
Caleb Swanigan,Sacramento Kings,PF,4/18/97,2033160
Al Horford,Philadelphia 76ers,C,6/3/86,28000000
Clint Capela,Houston Rockets,C,5/18/94,16896552
Georges Niang,Utah Jazz,PF,6/17/93,1645357
Wesley Matthews,Milwaukee Bucks,SF,10/14/86,2564753
Rajon Rondo,Los Angeles Lakers,PG,2/22/86,2564753
Delon Wright,Dallas Mavericks,PG,4/26/92,9473684
Ja Morant,Memphis Grizzlies,PG,8/10/99,8730240
Fred VanVleet,Toronto Raptors,PG,2/25/94,9346153
Brandon Clarke,Memphis Grizzlies,PF,9/19/96,2478840
Miye Oni,Utah Jazz,SG,8/4/97,898310
Julius Randle,New York Knicks,C,11/29/94,18000000
Glenn Robinson III,Golden State Warriors,SF,1/8/94,1882867
Dillon Brooks,Memphis Grizzlies,SF,1/22/96,1618520
Zylan Cheatham,New Orleans Pelicans,SF,11/17/95,79568
Markieff Morris,Detroit Pistons,PF,9/2/89,3200000
Malik Beasley,Denver Nuggets,SG,11/26/96,2731713
John Wall,Washington Wizards,PG,9/6/90,38199000
Vlatko Cancar,Denver Nuggets,SF,4/10/97,898310
Alize Johnson,Indiana Pacers,PF,4/22/96,1416852
Andrew Wiggins,Minnesota Timberwolves,SF,2/23/95,27504630
Khyri Thomas,Detroit Pistons,SG,5/8/96,1416852
Mitchell Robinson,New York Knicks,C,4/1/98,1559712
Damian Lillard,Portland Trail Blazers,PG,7/15/90,29802321
Nassir Little,Portland Trail Blazers,PF,2/11/00,2105520
Mikal Bridges,Phoenix Suns,SF,8/30/96,4161000
Kyle Anderson,Memphis Grizzlies,PF,9/20/93,9073050
Garrett Temple,Brooklyn Nets,PG,5/8/86,4767000
Kyle Korver,Milwaukee Bucks,PF,3/17/81,6004753
Al-Farouq Aminu,Orlando Magic,PF,9/21/90,9258000
James Harden,Houston Rockets,PG,8/26/89,38199000
Derrick White,San Antonio Spurs,PG,7/2/94,1948080
JaKarr Sampson,Indiana Pacers,SF,3/20/93,1737145
Dario Saric,Phoenix Suns,PF,4/8/94,3481985
Ivica Zubac,Los Angeles Clippers,C,3/18/97,6481482
Juan Hernangomez,Denver Nuggets,PF,9/28/95,3321029
Jarrell Brantley,Utah Jazz,PF,6/7/96,79568
Eric Gordon,Houston Rockets,PG,12/25/88,14057730
Naz Reid,Minnesota Timberwolves,F,8/26/99,898310
Justin Robinson,Washington Wizards,PG,10/12/97,898310
Grayson Allen,Memphis Grizzlies,SG,10/8/95,2429400
Trevor Ariza,Sacramento Kings,SF,6/30/85,12200000
Brandon Goodwin,Atlanta Hawks,PG,10/2/95,79568
E'Twaun Moore,New Orleans Pelicans,PG,2/25/89,8664928
Mario Hezonja,Portland Trail Blazers,PF,2/25/95,1737145
Henry Ellenson,Brooklyn Nets,PF,1/13/97,79568
Johnathan Motley,Los Angeles Clippers,PF,5/4/95,79568
James Ennis,Philadelphia 76ers,SF,7/1/90,1882867
Andre Roberson,Oklahoma City Thunder,SF,12/4/91,10740740
Garrison Mathews,Washington Wizards,SG,10/24/96,79568
Jahlil Okafor,New Orleans Pelicans,C,12/15/95,1702486
Mfiondu Kabengele,Los Angeles Clippers,C,8/14/97,1977000
Treveon Graham,Minnesota Timberwolves,SG,10/28/93,1645357
Seth Curry,Dallas Mavericks,PG,8/23/90,7461380
D'Angelo Russell,Golden State Warriors,PG,2/23/96,27285000
Justin Holiday,Indiana Pacers,SG,4/5/89,4767000
Tyrone Wallace,Atlanta Hawks,PG,6/10/94,1620564
Miles Bridges,Charlotte Hornets,SF,3/21/98,3755400
Bogdan Bogdanovic,Sacramento Kings,SG,8/18/92,8529386
Matt Thomas,Toronto Raptors,SG,8/4/94,898310
Jordan Bell,Minnesota Timberwolves,C,1/7/95,1620564
Wenyen Gabriel,Sacramento Kings,PF,3/26/97,79568
Tony Snell,Detroit Pistons,SF,11/10/91,11392857
Shaquille Harrison,Chicago Bulls,PG,10/6/93,1620564
Yogi Ferrell,Sacramento Kings,PG,5/9/93,3150000
Mike Scott,Philadelphia 76ers,PF,7/16/88,4767000
Jarred Vanderbilt,Denver Nuggets,PF,4/3/99,1416852
Jeff Teague,Minnesota Timberwolves,PG,6/10/88,19000000
Zach Norvell,Los Angeles Lakers,SG,12/9/97,79568
Maxi Kleber,Dallas Mavericks,C,1/29/92,8000000
Matisse Thybulle,Philadelphia 76ers,SG,3/4/97,2582160
Ryan Arcidiacono,Chicago Bulls,PG,3/26/94,3000000
Wayne Ellington,New York Knicks,SG,11/29/87,8000000
Kawhi Leonard,Los Angeles Clippers,SF,6/29/91,32742000
Montrezl Harrell,Los Angeles Clippers,C,1/26/94,6000000
Jusuf Nurkic,Portland Trail Blazers,C,8/23/94,12000000
Matthew Dellavedova,Cleveland Cavaliers,PG,9/8/90,9607500
Cody Martin,Charlotte Hornets,SF,9/28/95,1173310
Zhaire Smith,Philadelphia 76ers,SG,6/4/99,3058800
RJ Barrett,New York Knicks,SG,6/14/00,7839960
Lonnie Walker,San Antonio Spurs,SG,12/14/98,2764200
Taurean Prince,Brooklyn Nets,SF,3/22/94,3481985
Elfrid Payton,New York Knicks,PG,2/22/94,8000000
Blake Griffin,Detroit Pistons,PF,3/16/89,34449964
Marko Guduric,Memphis Grizzlies,SG,3/8/95,2625000
Zach Collins,Portland Trail Blazers,C,11/19/97,4240200
Stanley Johnson,Toronto Raptors,PF,5/29/96,3623000
Boban Marjanovic,Dallas Mavericks,C,8/15/88,3500000
Josh Magette,Orlando Magic,PG,11/28/89,79568
Kyle Lowry,Toronto Raptors,PG,3/25/86,33296296
Darius Garland,Cleveland Cavaliers,PG,1/26/00,6400920
Frank Jackson,New Orleans Pelicans,PG,5/4/98,1618520
Dragan Bender,Milwaukee Bucks,PF,11/17/97,1678854
Kenrich Williams,New Orleans Pelicans,PF,12/2/94,1416852
Jerami Grant,Denver Nuggets,PF,3/12/94,9346153
Allonzo Trier,New York Knicks,PG,1/17/96,3551100
Pat Connaughton,Milwaukee Bucks,SG,1/6/93,1723050
Domantas Sabonis,Indiana Pacers,C,5/3/96,3529554
Dylan Windler,Cleveland Cavaliers,GF,9/22/96,2035800
Antonius Cleveland,Dallas Mavericks,SG,2/2/94,79568
Damion Lee,Golden State Warriors,SG,10/21/92,79568
Khem Birch,Orlando Magic,C,9/28/92,3000000
Aron Baynes,Phoenix Suns,C,12/9/86,5453280
Kemba Walker,Boston Celtics,PG,5/8/90,32742000
Nerlens Noel,Oklahoma City Thunder,C,4/10/94,1882867
Jabari Parker,Atlanta Hawks,PF,3/15/95,6500000
Carsen Edwards,Boston Celtics,SG,3/12/98,1228026
Anthony Tolliver,Portland Trail Blazers,PF,6/1/85,2564753
Lauri Markkanen,Chicago Bulls,PF,5/22/97,5300400
Kris Dunn,Chicago Bulls,PG,3/18/94,5348007
Reggie Bullock,New York Knicks,SF,3/16/91,4000000
Mike Conley,Utah Jazz,PG,10/11/87,32511623
Jaylen Nowell,Minnesota Timberwolves,SG,7/9/99,1400000
Gorgui Dieng,Minnesota Timberwolves,C,1/18/90,16229213
Patrick Patterson,Los Angeles Clippers,PF,3/14/89,3068660
Jarrett Allen,Brooklyn Nets,C,4/21/98,2376840
Bobby Portis,New York Knicks,C,2/10/95,15000000
Joel Embiid,Philadelphia 76ers,C,3/16/94,27504630
Jonas Valanciunas,Memphis Grizzlies,C,5/6/92,16000000
Chris Chiozza,Washington Wizards,PG,11/21/95,79568
Kent Bazemore,Portland Trail Blazers,SF,7/1/89,19269663
Tristan Thompson,Cleveland Cavaliers,C,3/13/91,18539130
Mason Plumlee,Denver Nuggets,C,3/5/90,14041096
Shabazz Napier,Minnesota Timberwolves,PG,7/14/91,1845301
Edmond Sumner,Indiana Pacers,PG,12/31/95,2000000
Alex Len,Atlanta Hawks,C,6/16/93,4160000
Josh Richardson,Philadelphia 76ers,SF,9/15/93,10116576
Bojan Bogdanovic,Utah Jazz,SF,4/18/89,17000000
Iman Shumpert,Brooklyn Nets,PG,6/26/90,2031676
Daryl Macon,Miami Heat,SG,11/29/95,79568
Rodney McGruder,Los Angeles Clippers,SG,7/29/91,4807693
Bam Adebayo,Miami Heat,C,7/18/97,3454080
Jacob Evans,Golden State Warriors,SG,6/18/97,1928280
Nigel Williams-Goss,Utah Jazz,PG,9/16/94,1500000
Terrance Ferguson,Oklahoma City Thunder,SF,5/17/98,2475840
Michael Carter-Williams,Orlando Magic,PG,10/10/91,2028594
Bol Bol,Denver Nuggets,C,11/16/99,79568
Willie Cauley-Stein,Golden State Warriors,C,8/18/93,2177483
Nikola Vucevic,Orlando Magic,C,10/24/90,28000000
Nicolas Batum,Charlotte Hornets,SF,12/14/88,25565217
Kyrie Irving,Brooklyn Nets,PG,3/23/92,31742000
Jeremy Lamb,Indiana Pacers,SF,5/30/92,10500000
Donovan Mitchell,Utah Jazz,SG,9/7/96,3635760
Thanasis Antetokounmpo,Milwaukee Bucks,SF,7/18/92,1445697
James Johnson,Miami Heat,PF,2/20/87,15349400
Monte Morris,Denver Nuggets,PG,6/27/95,1588231
Terry Rozier,Charlotte Hornets,PG,3/17/94,19894737
DeAndre Jordan,Brooklyn Nets,C,7/21/88,9881598
Jae Crowder,Memphis Grizzlies,SF,7/6/90,7815533
Josh Gray,New Orleans Pelicans,PG,9/9/93,79568
Goga Bitadze,Indiana Pacers,C,7/20/99,2816760
Kobi Simmons,Charlotte Hornets,PG,7/4/97,79568
Derrick Favors,New Orleans Pelicans,C,7/15/91,17650000
Landry Shamet,Los Angeles Clippers,SG,3/13/97,1995120
Jalen McDaniels,Charlotte Hornets,PF,1/31/98,898310
Bruno Caboclo,Memphis Grizzlies,SF,9/21/95,1845301
Drew Eubanks,San Antonio Spurs,PF,2/1/97,79568
Raul Neto,Philadelphia 76ers,PG,5/19/92,1737145
Jalen Lecque,Phoenix Suns,G,6/13/00,898310
Giannis Antetokounmpo,Milwaukee Bucks,PF,12/6/94,25842697
Malik Monk,Charlotte Hornets,SG,2/4/98,4028400
Tacko Fall,Boston Celtics,C,12/10/95,79568
Justin Jackson,Dallas Mavericks,PF,3/28/95,3280920
Paul George,Los Angeles Clippers,SF,5/2/90,33005556
Jayson Tatum,Boston Celtics,PF,3/3/98,7830000
Admiral Schofield,Washington Wizards,SF,3/30/97,1000000
Louis King,Detroit Pistons,F,4/6/99,79568
Kostas Antetokounmpo,Los Angeles Lakers,PF,11/20/97,79568
Rodions Kurucs,Brooklyn Nets,PF,2/5/98,1699236
Spencer Dinwiddie,Brooklyn Nets,PG,4/6/93,10605600
Doug McDermott,Indiana Pacers,PF,1/3/92,7333333
Romeo Langford,Boston Celtics,SG,10/25/99,3458400
Caris LeVert,Brooklyn Nets,SF,8/25/94,2625717
Michael Kidd-Gilchrist,Charlotte Hornets,PF,9/26/93,13000000
LeBron James,Los Angeles Lakers,PF,12/30/84,37436858
Taj Gibson,New York Knicks,C,6/24/85,9000000
Ty Jerome,Phoenix Suns,G,7/8/97,2193480
Chris Clemons,Houston Rockets,SG,7/23/97,79568
Luke Kornet,Chicago Bulls,C,7/15/95,2250000
Trey Lyles,San Antonio Spurs,PF,11/5/95,5500000
Sterling Brown,Milwaukee Bucks,SF,2/10/95,1618520
Andre Iguodala,Memphis Grizzlies,SF,1/28/84,17185185
Vincent Poirier,Boston Celtics,C,10/17/93,2505793
Frank Ntilikina,New York Knicks,PG,7/28/98,4855800
Jordan McRae,Washington Wizards,PG,3/28/91,1645357
Enes Kanter,Boston Celtics,C,5/20/92,4767000
John Henson,Cleveland Cavaliers,C,12/28/90,9732396
Jaylen Brown,Boston Celtics,SF,10/24/96,6534829
Jonah Bolden,Philadelphia 76ers,PF,1/2/96,1698450
Chimezie Metu,San Antonio Spurs,PF,3/22/97,1416852
Tobias Harris,Philadelphia 76ers,PF,7/15/92,32742000
Semi Ojeleye,Boston Celtics,PF,12/5/94,1618520
Jevon Carter,Phoenix Suns,PG,9/14/95,1416852
Brandon Ingram,New Orleans Pelicans,PF,9/2/97,7265485
Moritz Wagner,Washington Wizards,C,4/26/97,2063520
Dorian Finney-Smith,Dallas Mavericks,PF,5/4/93,4000000
Danuel House,Houston Rockets,SF,6/7/93,3540000
Nicolo Melli,New Orleans Pelicans,C,1/26/91,4102564
Talen Horton-Tucker,Los Angeles Lakers,GF,11/25/00,898310
Ed Davis,Utah Jazz,C,6/5/89,4767000
Kyle Guy,Sacramento Kings,G,8/11/97,79568
Kadeem Allen,New York Knicks,PG,1/15/93,79568
Dante Exum,Utah Jazz,PG,7/13/95,9600000
Abdel Nader,Oklahoma City Thunder,SF,9/25/93,1618520
Bruno Fernando,Atlanta Hawks,C,8/15/98,1400000
Dion Waiters,Miami Heat,SG,12/10/91,12100000
Jared Dudley,Los Angeles Lakers,PF,7/10/85,2564753
Max Strus,Chicago Bulls,SG,3/28/96,79568
Kevon Looney,Golden State Warriors,C,2/6/96,4464286
Willy Hernangomez,Charlotte Hornets,C,5/27/94,1557250
Melvin Frazier,Orlando Magic,SG,8/30/96,1416852
Austin Rivers,Houston Rockets,PG,8/1/92,2174310
Harry Giles,Sacramento Kings,PF,4/22/98,2578800
Robin Lopez,Milwaukee Bucks,C,4/1/88,4767000
Collin Sexton,Cleveland Cavaliers,PG,1/4/99,4764960
Ricky Rubio,Phoenix Suns,PG,10/21/90,16200000

Writing datas/nba.csv

In [18]:
nba = pd.read_csv("datas/nba.csv", parse_dates=["Birthday"])
nba

               Name                 Team Position   Birthday    Salary
0      Shake Milton   Philadelphia 76ers       SG 1996-09-26   1445697
1    Christian Wood      Detroit Pistons       PF 1995-09-27   1645357
2     PJ Washington    Charlotte Hornets       PF 1998-08-23   3831840
3      Derrick Rose      Detroit Pistons       PG 1988-10-04   7317074
4     Marial Shayok   Philadelphia 76ers        G 1995-07-26     79568
..              ...                  ...      ...        ...       ...
445   Austin Rivers      Houston Rockets       PG 1992-08-01   2174310
446     Harry Giles     Sacramento Kings       PF 1998-04-22   2578800
447     Robin Lopez      Milwaukee Bucks        C 1988-04-01   4767000
448   Collin Sexton  Cleveland Cavaliers       PG 1999-01-04   4764960
449     Ricky Rubio         Phoenix Suns       PG 1990-10-21  16200000

[450 rows x 5 columns]

In [19]:
nba.count()

Name        450
Team        450
Position    450
Birthday    450
Salary      450
dtype: int64

In [20]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [21]:
nba_type = nba.dtypes
nba_type.values

array([dtype('O'), dtype('O'), dtype('O'), dtype('<M8[ns]'),
       dtype('int64')], dtype=object)

In [22]:
nba_type.value_counts()

object            3
datetime64[ns]    1
int64             1
dtype: int64

In [23]:
nba.ndim

2

In [24]:
nba.shape

(450, 5)

In [25]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [26]:
nba.index

RangeIndex(start=0, stop=450, step=1)

In [27]:
len(nba)

450

In [28]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [29]:
len(nba) - nba.nunique()

Name          0
Team        420
Position    441
Birthday     20
Salary      181
dtype: int64

In [30]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [31]:
nba.values

array([['Shake Milton', 'Philadelphia 76ers', 'SG',
        Timestamp('1996-09-26 00:00:00'), 1445697],
       ['Christian Wood', 'Detroit Pistons', 'PF',
        Timestamp('1995-09-27 00:00:00'), 1645357],
       ['PJ Washington', 'Charlotte Hornets', 'PF',
        Timestamp('1998-08-23 00:00:00'), 3831840],
       ...,
       ['Robin Lopez', 'Milwaukee Bucks', 'C',
        Timestamp('1988-04-01 00:00:00'), 4767000],
       ['Collin Sexton', 'Cleveland Cavaliers', 'PG',
        Timestamp('1999-01-04 00:00:00'), 4764960],
       ['Ricky Rubio', 'Phoenix Suns', 'PG',
        Timestamp('1990-10-21 00:00:00'), 16200000]], dtype=object)

In [32]:
nba.count().sum()

2250

In [33]:
nba.nunique()

Name        450
Team         30
Position      9
Birthday    430
Salary      269
dtype: int64

In [34]:
nba.max()

Name             Zylan Cheatham
Team         Washington Wizards
Position                     SG
Birthday    2000-12-23 00:00:00
Salary                 40231758
dtype: object

In [35]:
nba.min()

Name               Aaron Gordon
Team              Atlanta Hawks
Position                      C
Birthday    1977-01-26 00:00:00
Salary                    79568
dtype: object

In [36]:
nba.index

RangeIndex(start=0, stop=450, step=1)

In [37]:
nba.columns

Index(['Name', 'Team', 'Position', 'Birthday', 'Salary'], dtype='object')

In [38]:
nba.nlargest(5, columns = ["Salary"])

                  Name                   Team Position   Birthday    Salary
205      Stephen Curry  Golden State Warriors       PG 1988-03-14  40231758
38          Chris Paul  Oklahoma City Thunder       PG 1985-05-06  38506482
219  Russell Westbrook        Houston Rockets       PG 1988-11-12  38506482
251          John Wall     Washington Wizards       PG 1990-09-06  38199000
264       James Harden        Houston Rockets       PG 1989-08-26  38199000

In [39]:
nba.nlargest(5, columns = ["Birthday"])

                    Name                  Team Position   Birthday   Salary
136      Sekou Doumbouya       Detroit Pistons       SF 2000-12-23  3285120
432  Talen Horton-Tucker    Los Angeles Lakers       GF 2000-11-25   898310
137      Zion Williamson  New Orleans Pelicans        F 2000-07-06  9757440
313           RJ Barrett       New York Knicks       SG 2000-06-14  7839960
392         Jalen Lecque          Phoenix Suns        G 2000-06-13   898310

In [40]:
nba.nsmallest(5, columns = ["Birthday"])

               Name               Team Position   Birthday    Salary
98     Vince Carter      Atlanta Hawks       PF 1977-01-26   2564753
196   Udonis Haslem         Miami Heat        C 1980-06-09   2564753
262     Kyle Korver    Milwaukee Bucks       PF 1981-03-17   6004753
149  Tyson Chandler    Houston Rockets        C 1982-10-02   2564753
415  Andre Iguodala  Memphis Grizzlies       SF 1984-01-28  17185185

In [47]:
nba.head()

             Name                Team Position   Birthday   Salary
0    Shake Milton  Philadelphia 76ers       SG 1996-09-26  1445697
1  Christian Wood     Detroit Pistons       PF 1995-09-27  1645357
2   PJ Washington   Charlotte Hornets       PF 1998-08-23  3831840
3    Derrick Rose     Detroit Pistons       PG 1988-10-04  7317074
4   Marial Shayok  Philadelphia 76ers        G 1995-07-26    79568

In [60]:
#numeric_only로 수치형 데이터만 계산
nba.sum(numeric_only=True)

Salary    3444112694
dtype: int64

In [56]:
nba.mean(numeric_only=True)

Salary    7.653584e+06
dtype: float64

In [57]:
nba.median(numeric_only=True)

Salary    3303074.5
dtype: float64

In [58]:
nba.std(numeric_only=True)

Salary    9.288810e+06
dtype: float64

In [64]:
#ascending에 bool값 입력하면 오름차순 내림차순을 맘대로 조정가능
titanic.sort_values(by = ["fare","age","sex"], ascending=[False,True,True],na_position="last")

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
258,1,1,female,35.0,0,0,512.3292,C,First,woman,False,NaN,Cherbourg,yes,True
737,1,1,male,35.0,0,0,512.3292,C,First,man,True,B,Cherbourg,yes,True
679,1,1,male,36.0,0,1,512.3292,C,First,man,True,B,Cherbourg,yes,False
27,0,1,male,19.0,3,2,263.0000,S,First,man,True,C,Southampton,no,False
88,1,1,female,23.0,3,2,263.0000,S,First,woman,False,C,Southampton,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
481,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
633,0,1,male,NaN,0,0,0.0000,S,First,man,True,NaN,Southampton,no,True
674,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
732,0,2,male,NaN,0,0,0.0000,S,Second,man,True,NaN,Southampton,no,True
815,0,1,male,NaN,0,0,0.0000,S,First,man,True,B,Southampton,no,True

In [66]:
#컬럼 정렬
titanic.sort_index(axis=1)

,adult_male,age,alive,alone,class,deck,embark_town,embarked,fare,parch,pclass,sex,sibsp,survived,who
0,True,22.0,no,False,Third,NaN,Southampton,S,7.2500,0,3,male,1,0,man
1,False,38.0,yes,False,First,C,Cherbourg,C,71.2833,0,1,female,1,1,woman
2,False,26.0,yes,True,Third,NaN,Southampton,S,7.9250,0,3,female,0,1,woman
3,False,35.0,yes,False,First,C,Southampton,S,53.1000,0,1,female,1,1,woman
4,True,35.0,no,True,Third,NaN,Southampton,S,8.0500,0,3,male,0,0,man
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
886,True,27.0,no,True,Second,NaN,Southampton,S,13.0000,0,2,male,0,0,man
887,False,19.0,yes,True,First,B,Southampton,S,30.0000,0,1,female,0,1,woman
888,False,NaN,no,False,Third,NaN,Southampton,S,23.4500,2,3,female,1,0,woman
889,True,26.0,yes,True,First,C,Cherbourg,C,30.0000,0,1,male,0,1,man
890,True,32.0,no,True,Third,NaN,Queenstown,Q,7.7500,0,3,male,0,0,man

In [67]:
titanic.value_counts('sex').sort_values(ascending=False)

sex
male      577
female    314
dtype: int64

In [72]:
titanic.value_counts('age').sort_values(ascending=False)

age
24.00    30
22.00    27
18.00    26
30.00    25
28.00    25
         ..
0.42      1
66.00     1
70.50     1
74.00     1
80.00     1
Length: 88, dtype: int64

In [73]:
titanic.value_counts('class').sort_values(ascending=False)

class
Third     491
First     216
Second    184
dtype: int64

In [76]:
titanic['alive'].value_counts().sort_values(ascending=False)

no     549
yes    342
Name: alive, dtype: int64

In [106]:
df =pd.DataFrame(data = np.arange(10,22).reshape(3,4), index=['a','b','c'], columns=list("ABCD"))
df

    A   B   C   D
a  10  11  12  13
b  14  15  16  17
c  18  19  20  21

In [100]:
#영어 문자열은 속성처럼 접근 가능
df.A

a    10
b    14
c    18
Name: A, dtype: int32

In [99]:
df.loc[df.A>15]

    A   B   C   D
c  18  19  20  21

In [101]:
df2 =pd.DataFrame(data = np.arange(10,26).reshape(4,4), columns=list("ABCD"))
df2

    A   B   C   D
0  10  11  12  13
1  14  15  16  17
2  18  19  20  21
3  22  23  24  25

In [109]:
#iloc와 다르게 2까지 가져옴(문자로 인식해서?)
df2.loc[1:2]

    A   B   C   D
1  14  15  16  17
2  18  19  20  21

In [103]:
df2.iloc[1:2]

    A   B   C   D
1  14  15  16  17

In [113]:
df.loc["a","A"]

10

In [116]:
#하나의 값 가져올때는 at을 쓰는게 훨씬 빠르다
df.at["a","A"]

10

In [117]:
df.loc["b":,"A"]

b    14
c    18
Name: A, dtype: int32

In [118]:
df.loc[["a","b"],["B","D"]]

    B   D
a  11  13
b  15  17

In [133]:
df.loc["a":"c","A":"C"]

    A   B   C
a  10  11  12
b  14  15  16
c  18  19  20

In [121]:
df.loc[df.A>10,["C","D"]]

    C   D
b  16  17
c  20  21

In [142]:
df.iloc[:2,-1::-1]

    D   C   B   A
a  13  12  11  10
b  17  16  15  14

In [148]:
round(titanic.age.mean(),2)

29.7

# titanic.head()

In [161]:
round(titanic.age.mean(),1)

29.7

In [159]:
round(titanic['age'][titanic['sex'] == 'female'].mean(),1)

27.9

In [185]:
round(titanic['age'][titanic['sex'] == 'female'][titanic['pclass'] == 1].mean(),1)

34.6

In [363]:
Team=[]
Team_list =[]
name_list = teams['성명']
while len(name_list) != 0:
    random_num = np.random.randint(len(name_list))
    Team.append(name_list[random_num])
    del name_list[random_num]
    if len(Team) == 4:
        Team_list.append(Team)
        Team.clear()
print(Team_list)

SyntaxError: invalid syntax (2155637024.py, line 8)

In [315]:
import random
a = np.random.randint(1,26)
a

18

,survived,pclass,sex,age,sibsp,parch,fare,embarked,class,who,adult_male,deck,embark_town,alive,alone
1,1,1,female,38.0,1,0,71.2833,C,First,woman,False,C,Cherbourg,yes,False
2,1,3,female,26.0,0,0,7.9250,S,Third,woman,False,NaN,Southampton,yes,True
3,1,1,female,35.0,1,0,53.1000,S,First,woman,False,C,Southampton,yes,False
8,1,3,female,27.0,0,2,11.1333,S,Third,woman,False,NaN,Southampton,yes,False
9,1,2,female,14.0,1,0,30.0708,C,Second,child,False,NaN,Cherbourg,yes,False
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
880,1,2,female,25.0,0,1,26.0000,S,Second,woman,False,NaN,Southampton,yes,False
882,0,3,female,22.0,0,0,10.5167,S,Third,woman,False,NaN,Southampton,no,True
885,0,3,female,39.0,0,5,29.1250,Q,Third,woman,False,NaN,Queenstown,no,False
887,1,1,female,19.0,0,0,30.0000,S,First,woman,False,B,Southampton,yes,True
888,0,3,female,NaN,1,2,23.4500,S,Third,woman,False,NaN,Southampton,no,False

In [377]:
teams = pd.read_csv('teams.csv')
teams.head()

    성명 성별
0  강예림  여
1  강호정  남
2  고유리  여
3  김정인  여
4  김지성  남

In [355]:
nums = [_%7 for _ in np.arange(28)]
random.shuffle(nums)
nums

[4,
 3,
 6,
 0,
 5,
 1,
 1,
 3,
 3,
 5,
 4,
 2,
 3,
 4,
 5,
 5,
 0,
 1,
 2,
 6,
 6,
 6,
 2,
 4,
 1,
 0,
 2,
 0]

In [414]:
team_nums = [_%7 for _ in np.arange(28)]
random.shuffle(team_nums)
team_nums
teams['팀'] = team_nums
teams['팀'] +=1
teams.sort_values('팀')

     성명 성별  팀
20  임혜신  여  1
26  최진명  남  1
12  유영은  여  1
9   배선화  여  1
17  이윤진  여  2
8   박수현  여  2
0   강예림  여  2
24  조재희  남  2
19  이주현  남  3
11  유승현  남  3
25  채경민  남  3
22  정현호  남  3
14  유준선  남  4
1   강호정  남  4
18  이주현  여  4
10  서덕원  남  4
5   김지오  여  5
4   김지성  남  5
3   김정인  여  5
21  장서현  여  5
23  조세연  남  6
27  한혜원  여  6
15  윤영주  여  6
2   고유리  여  6
7   박기영  남  7
6   노재승  남  7
16  이유단  여  7
13  유예빈  여  7

In [410]:
Team=[]
Team_list =[]
name_list = list(teams['성명'])
while len(name_list) != 0:
    random_num = np.random.randint(len(name_list))
    Team.append(name_list[random_num])
    name_list.remove(name_list[random_num])
    if len(Team) == 4:
        Team_list.append(Team)
        Team=[]
pd.DataFrame(data = Team_list,index = np.arange(1,8))

     0    1    2    3
1  고유리  정현호  장서현  조재희
2  김정인  조세연  유영은  한혜원
3  유승현  최진명  유예빈  이유단
4  서덕원  박기영  이주현  강예림
5  배선화  김지성  박수현  임혜신
6  유준선  채경민  이윤진  노재승
7  김지오  강호정  윤영주  이주현